InformationRegisters/ИсторияИспользованияОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИспользованияОтчетов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Предприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Предприятия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрефиксПредприятия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПредприятия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Учет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АльтНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытияУчет</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорпоративныйEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьВОтчетахГД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедетсяВалютныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролировать10</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролировать41</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролировать43</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранзитныйСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранзитноеПодразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьТранзитныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаАрендодателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйОбъемХранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьОФК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет79</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьДебиторскуюЗадолженность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтопроведениеПереводов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаМСФО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственноеПредприятие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗакрытияЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗакрытияЗатрат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьЗаявкиНаоплатуБезСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяПолитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеПолитики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОрганизацииДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопСписокРеспондентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Признак</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EMail</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокДокументовПодразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетПоПодразделениям</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/сабОбщегоНазначенияКлиентСервер/Ext/Module.bsl
Процедура СкрытьПодразделения(Форма, Элемент = Неопределено, ИмяРеквизитаПредприятие = "Предприятие") Экспорт
	
	Если Лев(Форма.ИмяФормы, 5) = "Отчет" Тогда
		Объект = Форма.Отчет;
	ИначеЕсли Форма.Параметры.Свойство("Ключ") Тогда //попробуем так отловить форму документа
		Объект = Форма.Объект;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Объект.Свойство(ИмяРеквизитаПредприятие) Тогда
		ТекПП = Объект[ИмяРеквизитаПредприятие];
	ИначеЕсли Объект.Свойство("Организация") Тогда	
		ТекПП = Объект.Организация;
	Иначе
		Возврат;
	КонецЕсли;
	
	УчетПоПодразделениям = БюджетныйНаСервере.ВернутьРеквизит(ТекПП, "УчетПоПодразделениям");
	Если УчетПоПодразделениям = Неопределено ИЛИ УчетПоПодразделениям = NULL Тогда
		УчетПоПодразделениям = Ложь;
	КонецЕсли; 
	
	ЭтоДокументДвиженияТМЦИОпцияВыключена = Ложь;
	Если Объект.Свойство("Ссылка") Тогда
		ЭтоДокументДвиженияТМЦИОпцияВыключена = ЭтоДокументДвиженияТМЦИОпцияВыключена(Объект.Ссылка);
	КонецЕсли;
	
	Если Объект.Свойство("Ссылка") И НЕ УчетПоПодразделениям Тогда
		Если БюджетныйНаСервере.ДокументПодразделениеИстина(Объект.Ссылка, ТекПП) Тогда
			Форма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("сабУчетПоПодразделениям", Истина));
		Иначе
			Форма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("сабУчетПоПодразделениям", ТекПП));
		КонецЕсли;
	Иначе
		//для подразделеений использование функциональных опций (новое д1 10.06.16)
		Если ЭтоДокументДвиженияТМЦИОпцияВыключена Тогда
			Форма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("сабУчетПоПодразделениям", ПредопределенноеЗначение("Справочник.Предприятия.ПустаяСсылка")));
		Иначе	
			Форма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("сабУчетПоПодразделениям", ТекПП));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоДокументДвиженияТМЦИОпцияВыключена(Ссылка) Экспорт
	МассивТипов =  Новый Массив;
	//МассивТипов.Добавить(Тип("ДокументСсылка.УЧ_ПоступлениеТоваров"));
	МассивТипов.Добавить(Тип("ДокументСсылка.УЧ_ПереводТМЦ"));
	МассивТипов.Добавить(Тип("ДокументСсылка.УЧ_ПеремещениеМатериаловВПроизводство"));
	МассивТипов.Добавить(Тип("ДокументСсылка.УЧ_ПеремещениеТоваров"));
	МассивТипов.Добавить(Тип("ДокументСсылка.УЧ_Реализация")); //??лишнее, т.к. продажи по подразделениям
	МассивТипов.Добавить(Тип("ДокументСсылка.УЧ_СписаниеТоваров"));
	МассивТипов.Добавить(Тип("ДокументСсылка.УЧ_ОприходованиеТоваров"));
	МассивТипов.Добавить(Тип("ДокументСсылка.УЧ_ВозвратТоваровПоставщику"));
	
	Возврат НЕ МассивТипов.Найти(ТипЗнч(Ссылка)) = Неопределено И НЕ БюджетныйНаСервере.УчетТМЦПоПодразделениям(Ссылка.Предприятие); 
КонецФункции // ()


Процедура СкрытьОрганизацию(Форма) Экспорт

	Если Лев(Форма.ИмяФормы, 5) = "Отчет" Тогда
		Объект = Форма.Отчет;
	ИначеЕсли Форма.Параметры.Свойство("Ключ") Тогда //попробуем так отловить форму документа
		Объект = Форма.Объект;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Объект.Свойство("Предприятие") Тогда
		ТекПП = Объект.Предприятие;
	ИначеЕсли Объект.Свойство("Организация") Тогда	
		ТекПП = Объект.Организация;
	Иначе
		Возврат;
	КонецЕсли;
	
	
	

	Если ТекПП.Пустая() Тогда
		Возврат;	
	КонецЕсли;
	
	УчетПоОрганизациям = БюджетныйНаСервере.ВернутьРеквизит(ТекПП, "УчетПоОрганизациям");
	
	//Если НЕ УчетПоОрганизациям Тогда
	//	УчетПоПодразделениям = БюджетныйНаСервере.ДокументПодразделениеИстина(ОбъектСсылка.Ссылка, ТекПП);
	//КонецЕсли;
	
	Для каждого ТекЭлемент Из Форма.Элементы Цикл
		Если ТекЭлемент.Имя = "Организация" Тогда
			ТекЭлемент.Видимость = УчетПоОрганизациям;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СкрытьПредприятие(Форма, ТекущийПользователь) Экспорт
	
	Форма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("ПользовательСистемное", ТекущийПользователь));
	
КонецПроцедуры

Функция ЭтоБуква(Символ) Экспорт
	
	Код = КодСимвола(Символ);
	
	Если (Код<=47) ИЛИ (Код>=58 И Код<=64) ИЛИ (Код>=91 И Код<=96)  ИЛИ (Код>=123 И Код<=126) Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Процедура СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, ИмяТабличнойЧасти = Неопределено, НомерСтроки = Неопределено, Поле = Неопределено, Отказ = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	
	Если ИмяТабличнойЧасти <> Неопределено Тогда
		Сообщение.Поле = ИмяТабличнойЧасти + "[" + (НомерСтроки - 1) + "]." + Поле;
	ИначеЕсли ЗначениеЗаполнено(Поле) Тогда
		Сообщение.Поле = Поле;
	КонецЕсли;
	
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры // СообщитьОбОшибке()

Функция ПолучитьСтрокуИзМассиваПодстрок(Массив, Разделитель = ",") Экспорт
	
	// возвращаемое значение функции
	Результат = "";
	
	Для Каждого Элемент ИЗ Массив Цикл
		
		Подстрока = ?(ТипЗнч(Элемент) = Тип("Строка"), Элемент, Строка(Элемент));
		
		РазделительПодстрок = ?(ПустаяСтрока(Результат), "", Разделитель);
		
		Результат = Результат + РазделительПодстрок + Подстрока;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


#Область ИсторияОткрытияОтчетов

&НаСервере
Процедура ИсторияИспользованияОтчетовОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	ЗаписатьИсториюОтчетовНаСервере(Источник);	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИсториюОтчетовНаСервере(Источник)
	ДатаФормированияОтчета = ТекущаяДата();
	НаименованиеОтчета = Строка(Источник);
	НаименованиеОтчета = Прав(НаименованиеОтчета,СтрДлина(НаименованиеОтчета) - 14);
	НаборЗаписей = РегистрыСведений.ИсторияИспользованияОтчетов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ДатаФормированияОтчета);
	НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	НаборЗаписей.Отбор.Отчет.Установить(НаименованиеОтчета);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Отчет = НаименованиеОтчета;
	НоваяЗапись.Период = ДатаФормированияОтчета;
	НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	НаборЗаписей.Записать(Ложь);
КонецПроцедуры
#КонецОбласти
